import model.Settings
import model.Song

fun main(args: Array<String>) {

//    val folder = "/home/nsa/Documents/Караоке/Агата Кристи/1988 - Второй фронт"
//    val file = "(06) [Агата Кристи] Коммунальный блюз"
//    createKaraoke(getSong(getSettings("${folder}/${file}.settings")))

    val mapFiles = mutableListOf<Pair<String,String>>(

//
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (01) [Пикник] - Из мышеловки"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (02) [Пикник] - От Кореи до Карелии"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (03) [Пикник] - Падший ангел - сын греха"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (04) [Пикник] - Мракобесие и джаз"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (05) [Пикник] - На луче..."),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (06) [Пикник] - Разбойники"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (07) [Пикник] - Заратустра"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (08) [Пикник] - Герр Захер Мозох"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (09) [Пикник] - В развороченном раю"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (10) [Пикник] - Эхо (от луча)"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (11) [Пикник] - Ихтиандр"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2007 - Мракобесие и джаз","2007 (12) [Пикник] - Coda"),

//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (01) [Пикник] - Недобитый романтик"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (02) [Пикник] - Гиперболоид"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (03) [Пикник] - Колдыри да колдобины"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (04) [Пикник] - Железные мантры"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (05) [Пикник] - Вот же это слово"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (06) [Пикник] - Лунатики"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (07) [Пикник] - Дом мой на двух ногах"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (08) [Пикник] - Существо"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (09) [Пикник] - Здесь живут дома-колодцы"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (10) [Пикник] - Цветок ненастья"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2008 - Железные мантры","2008 (11) [Пикник] - Приоткроется дверь..."),

//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (01) [Пикник] - Театр абсурда"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (02) [Пикник] - Пикник Кукла с человеческим лицом"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (03) [Пикник] - Не в опере венской"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (04) [Пикник] - Фетиш"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (05) [Пикник] - Карлик Нос"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (06) [Пикник] - Урим Туммим"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (07) [Пикник] - Русы косы, ноги босы"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (08) [Пикник] - Уйду-останусь"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (09) [Пикник] - Дикая певица"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (10) [Пикник] - Начало игры"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2010 - Театр абсурда","2010 (11) [Пикник] - И смоется грим"),

//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (01) [Пикник] - Декаданс"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (02) [Пикник] - Игла"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (03) [Пикник] - За пижоном пижон"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (04) [Пикник] - Вплети меня в своё кружево"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (05) [Пикник] - Клоун беспощадный"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (06) [Пикник] - Гильотины сечение, веревки петля"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (07) [Пикник] - Трилогия"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (08) [Пикник] - Инкогнито"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (09) [Пикник] - Прикосновение"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (10) [Пикник] - Звезда Декаданс"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2012 - Певец декаданса","2012 (11) [Пикник] - Быть может... (утешительная)"),

//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (01) [Пикник] - Кем бы ты ни был"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (02) [Пикник] - Чужестранец"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (03) [Пикник] - Потерянный"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (04) [Пикник] - Азбука Морзе"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (05) [Пикник] - Мотылёк"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (06) [Пикник] - Песня эмигранта"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (07) [Пикник] - Танго «Чёрная каракатица»"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (08) [Пикник] - Бетховен"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (09) [Пикник] - Вот и я не иду до конца"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2014 - Чужестранец","2014 (10) [Пикник] - Письмо"),

//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (01) [Пикник] - Лихие пришли времена"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (02) [Пикник] - Злая кровь"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (03) [Пикник] - Парню 90 лет"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (04) [Пикник] - Последний из Могикан"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (05) [Пикник] - Всё хорошо!"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (06) [Пикник] - Ты кукла из папье-маше"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (07) [Пикник] - Большая игра"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (08) [Пикник] - Принцесса"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (09) [Пикник] - Зачем"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2017 - Искры и Канкан","2017 (10) [Пикник] - Ничего..."),

//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (01) [Пикник] - Счастливчик"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (02) [Пикник] - В руках великана"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (03) [Пикник] - Лиловый корсет"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (04) [Пикник] - Сияние"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (05) [Пикник] - Такая их карма"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (06) [Пикник] - Разноцветные ленты"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (07) [Пикник] - Фильм окончен"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (08) [Пикник] - Душа самурая - меч"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (09) [Пикник] - Где душа летает…"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (10) [Пикник] - Эпизод № 10"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2019 - В руках великана","2019 (11) [Пикник] - Grand finale"),

//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (01) [Пикник] - Играй, струна, играй"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (02) [Пикник] - Дивись же, какими мы стали!"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (03) [Пикник] - Только не плачь, палач"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (04) [Пикник] - Сквозь одежды"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (05) [Пикник] - Женщина"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (06) [Пикник] - В любую минуту"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (07) [Пикник] - Одиночество"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (08) [Пикник] - Весёлый и злой"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (09) [Пикник] - Всё перевернётся"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (10) [Пикник] - Колдун"),
//        Pair("/home/nsa/Documents/Караоке/Пикник/2022 - Весёлый и злой","2022 (11) [Пикник] - Утро"),

        Pair("","")
    )
    mapFiles.forEach {
        if (it.first != "" && it.second != "") {
            createKaraokeAll("${it.first}/${it.second}.settings")
        }

    }

//    val folder = "/home/nsa/Documents/Караоке/Агата Кристи/1994 - Опиум"
//    val file = "(11) [Агата Кристи] Опиум для никого"
//    createKaraoke(getSong(getSettings("${folder}/${file}.settings")))


}

